app/views/messages/create.json.jbuilder

json.name         @message.user.name
json.created_at   @message.created_at
---
INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('aaa', 'niku.jpg', 1, 1, '2018-06-26 09:58:45', '2018-06-26 09:58:45')