app/controllers/messages_controller.rb

SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def index
     @message = Message.new
     @messages = @group.messages.includes(:user)
     respond_to do |format|
      format.html
      format.json { @new_messages = @messages.where("id > ?", params[:id]) }

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('tikyuu', 'tcr_m.jpg', 1, 1, '2018-06-13 03:26:36', '2018-06-13 03:26:36')
---
  def create
    @message = @group.messages.new(message_params)
    if @message.save