app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (name LIKE('%a%') and id != 1)
---
def index
  @users = User.where('name LIKE(?) and id != ?', "%#{params[:keyword]}%", current_user)